.data                           
out:  .asciz "Number: "    # строка ввода номера
result:  .asciz "Result: " # строка вывода результата
newline: .asciz "\n"       # отступы в строке

.text                           # начало кода
main:                           
    la   a0, out            
    li   a7, 4                  # a7 = 4: вызов вывода строки для ввода номера
    ecall                       # выводим строку ввода номера

    li   a7, 5                  # a7 = 5: вывоз вывода строки для вывода результата
    ecall                       # выводим строку вывода результата

    mv   t1, a0                 # сохраняем число t1
    li   t0, 17                 # число для сравнения

    beq  t1, t0, is_17          # если число = порядковому номеру в группе, переходим в is_17

    li   t2, 0                  # если порядковый номер не совпадает 
    j    print                  # вывод

is_17:                          # если порядковый номер в группе - 17
    li   t2, 1                  

print:                          # общий блок вывода результата
    la   a0, result            
    li   a7, 4                  # a7 = 4: вывести строку
    ecall                       # вывод

    mv   a0, t2                 # a0 = значение для вывода (0 или 1)
    li   a7, 1                  # a7 = 1: вывести целое число
    ecall                       # выводим 0 или 1

    la   a0, newline            # a0 = адрес символа перевода строки
    li   a7, 4                  # a7 = 4: вывести строку
    ecall                       # переходим на новую строку

    li   a7, 10                 # a7 = 10: останов
    ecall                       # выход