.data                                   
array:   .space 132                     # массив 33 * 4 байта = 132 байта
out:  .asciz "Number: "        	 	 # ввод чисел с консоль 	
countmsg: .asciz "Numbers count: "      # надпись перед выводом количества чисел
newline: .asciz "\n"                    # перевод строки

.text                                   # секция кода
main:                                  
    la   s0, array                      # s0 = адрес, куда писать следующий элемент
    li   s1, 0                          # s1 = счётчик записанных чисел 
    li   s2, 33                         # s2 = максимальное количество чисел - 33

read_loop:                              # цикл чтения
    bge  s1, s2, done                   # если считано 33 числа, заканчиваем чтение

    la   a0, out                    	 # a0 - адрес строки ввода
    li   a7, 4                          # a7 = 4 - адрес вывода строки
    ecall                               # вывод строки

    li   a7, 5                          # a7 = 5: чтение целого числа
    ecall                               # перевод числа в a0

    beqz a0, done                       # если введен 0, останов чтения

    sw   a0, 0(s0)                      # записываем число в массив по адресу из s0
    addi s0, s0, 4                      # сдвигаем указатель на следующий элемент, на 4 байта
    addi s1, s1, 1                      # увеличиваем счетчик записанных чисел на 1
    j    read_loop                      # возвращаемся к началу цикла

done:                                   
    la   a0, countmsg                   # a0 = адрес надписи 
    li   a7, 4                          # a7 = 4: вывести строку
    ecall                               # выводим надпись

    mv   a0, s1                         # a0 = количество записанных чисел
    li   a7, 1                          # a7 = 1: вывести целое число
    ecall                               # выводим количество

    la   a0, newline                    # a0 = адрес перевода строки
    li   a7, 4                          # a7 = 4: вывести строку
    ecall                               # переходим на новую строку

    li   a7, 10                         # a7 = 10: останов
    ecall                               # выход